#pragma once
namespace MegaGuard
{
    namespace HooksMgr
    {
        namespace Features
        {
            using namespace MegaGuard::Globals::Features;

            constexpr float TWO_PI = 6.283185482f;
            constexpr float PI = 3.141592741f;
            constexpr float HALF_PI = 1.570796371f;
            constexpr float DIFFERENCE_EPSILON = 0.001f;
            constexpr double DIFFERENCE_IDK = 0.2000000029802322f;
            constexpr double EPSILON = 9.999999974752427e-7;
            constexpr float PITCH_50 = 50.0f;




            void normalizeRadians(float* radian) 
            {
                *radian = std::fmod(*radian, TWO_PI);
                if (*radian < 0.0f) *radian += TWO_PI;
            }
            void clamp_yaw(float* yaw)
            {
                while (*yaw < 0.0f)
                    *yaw += TWO_PI;
                while (*yaw > TWO_PI)
                    *yaw -= TWO_PI;
            }

           


            enum ControlMode : std::uint32_t
            {
                ControlMode_FREE = 0,
                ControlMode_TARGET = 1,
                ControlMode_GAME = 2,
                ControlMode_WATCH = 3,
                ControlMode_UNKNOWN = 4
            };

            enum ViewMode
            {
                ViewMode_Normal = 0x0,
                ViewMode_Shoulder = 0x1,
                ViewMode_ZoomIn = 0x2,
                ViewMode_DoubleZoomIn = 0x3,
                ViewMode_FirstPerson = 0x4,
                ViewMode_WATCH_CAMERA_VIEW = 0x6,
                ViewMode_SELF_CAMERA_VIEW = 0x7,
                ViewMode_ZOMBIE_KING_VIEW = 0x9,
                ViewMode_ZOMBIE_SPEEDUP_VIEW = 0xA,
            };
            inline void* qmemcpy(void* dst, const void* src, size_t cnt)
            {
                char* out = (char*)dst;
                const char* in = (const char*)src;
                while (cnt > 0)
                {
                    *out++ = *in++;
                    --cnt;
                }
                return dst;
            }

            struct NiAVObject
            {
                std::uint8_t gap0[0x20];//0x0000
                float m_kWorldBound[3];//0x0020
                float m_fRadius;//0x002C
                float m_localRotate[9];//0x0030
                float m_localTranslate[3];//0x0054
                float m_fLocalScale;//0x0060
                float m_worldRotate[9];//0x0064
                float m_worldTranslate[3];//0x0088
                float m_worldScale;//0x0094
                std::uint8_t gap98[0x4];//0x0098
                DWORD* pdword9C;//0x009C
                std::uint8_t gapA0[0x4];//0x00A0
                DWORD dwordA4;//0x00A4
                void* m_spCollisionObject;//0x00A8
            };

            struct Matrix
            {
				char pad_0x0000[32];//0x0000
				float WorldPos[3];//0x0020
				char pad_0x002C[56];//0x002C
				float matrix_13;//0x0064 FORWARD X
				float matrix_12;//0x0068 UP Y
				float matrix_11;//0x006C
				float matrix_23;//0x0070 FORWARD Y
				float matrix_22;//0x0074 UP X
				float matrix_21;//0x0078
				float matrix_33;//0x007C FORWARD Z
				float matrix_32;//0x0080 UP Z
				float matrix_31;//0x0084
                float WorldPos2[3];
                char pad_0x0094[24];
                float matrix1[4];
                float matrix2[4];
                float matrix3[4];
                float matrix4[4];
                char pad_0x00EC[16];
                float Realnear;
                float Realfar;
                char pad_0x0104[12];
                float Viewport[4];
            };


            struct MovementInfo
            {
                std::uint8_t gap0[16];
                float coords[3];
            };

            struct CNetIO
            {
                std::uint8_t gap0[48];
                DWORD ping;
            };


            struct PlayerRoomInfo
            {
                DWORD sid;//0x0000
                DWORD Team;//0x0004
                DWORD RoomStatus;//0x0008
                DWORD HP1;//0x000C
                DWORD notHP2;//0x0010
                DWORD HP2;//0x0014
                std::uint8_t idk1[0x10c];//0x0018
                DWORD MeleeRange;//0x0124
                std::uint8_t _idk2[0x9FC];//0x0128
                DWORD HP_MAX1;//0x0B24
                DWORD notHP_MAX2;//0x0B28
                DWORD HP_MAX2;//0x0B2C
                float Yaw;//0x0B30
                float Pitch;//0x0B34
            };

            struct CGamePlayerVirtualFuncs
            {
                std::uint8_t gap0[36];
                int(__thiscall* pfunc24)(struct CGamePlayer*);
            };

            struct CExPlayer
            {
				DWORD* VirtualFunctions;//0x0000
				PlayerRoomInfo* room_info;//0x0004
				DWORD unk1;//0x0008
				CNetIO* CNetIO;//0x000C
				MovementInfo* MovementInfo;//0x0010
            };
            struct CUnitRootNode
            {
                std::uint8_t gap0[0x88];
                float root_pos[3];
            };
            class CBone
            {
            public:
                int8_t _empty[0x88];
                float position[3];
                float* GetTransform(int index)
                {
                    return (float*)(((DWORD*)&this->position) + (0x37 * index));
                }
            };
            struct UnitMoveState
            {
                std::uint32_t virtual_functions;
                std::uint32_t idk;
                std::uint32_t anim_id;
            };
            struct CUnitMoveStateMgr
            {
                std::uint8_t idk1[0x18];//0x0000
				UnitMoveState* UnitMoveState;//0x0018
            };

            struct PlayerActionState
            {
                std::uint32_t virtual_functions;
                std::uint32_t anim_id;
            };
            struct CPlayerActionStateMgr
            {
                std::uint8_t idk1[0xC];//0x0000
                PlayerActionState* PlayerActionState;//0x00C
            };

            struct CGamePlayer
            {
                CGamePlayerVirtualFuncs* VirtualFunctions;//0x0
                std::uint8_t gap4[264];//0x4
                CExPlayer* CExPlayer;//0x10c
                std::uint8_t gap110[0x14];//0x110
                struct CPlayerModelProperty* CPlayerModelProperty;//0x124
				CUnitMoveStateMgr* CUnitMoveStateMgr;//0x128
				CPlayerActionStateMgr* CPlayerActionStateMgr;//0x12C

            };

            struct CPlayerModelProperty
            {
                std::uint8_t idk1[0x98];//0x0000
                std::uint32_t character_bone_type;//0x98
                std::uint8_t idk2[0x8];//0x9c
                float Rotation;//0x00a4
                float Pitch;//0x00a8
                float idk_ac;//0x00ac
                //std::uint8_t idk3[0x14];//0x00b0
				float idk_b0;//0x00b0
				float idk_b4;//0x00b4
				float idk_b8;//0x00b8
				float idk_bc;//0x00bc
				float idk_c0;//0x00c0
                float idk_c4;//0x00c4
                float idk_c8;//0x00c8
                std::uint8_t idk6[0xA4];//0x00cc
                CBone* HumanBones;//0x0170
                CBone* ZombieBones;//0x0174
                CBone* ZombieKingBones;//0x0178
                std::uint8_t idk7[0x290];//0x17C
                CUnitRootNode* CUnitRootNode;//0x40c
                std::uint8_t idk8[0x40];//0x410
                struct CGamePlayer* CGamePlayer;//0x450
            };



            struct CCameraTPS
            {
                std::uint8_t gap0[4];//0x0000
                float float4;//0x0004
                float float8;//0x0008
                float RotationX;//0x000C
                float RotationY;//0x0010
                DWORD m_eControlMode;//0x0014
                std::uint8_t gap18[16];//0x0018
                float CameraPitch;//0x0028 Camera Pitch
                float CameraYaw;//0x002C Camera Yaw
                float float30;//0x0030
                std::uint8_t gap34[64];//0x0034
                float float74;//0x0074
                float float78;//0x0078
                float float7C;//0x007C
                float WorldPos[3];  //0x0080
                float float8C;//0x008C
                float float90;//0x0090
                std::uint8_t gap94[36];//0x0094
                Matrix* Matrix;//0x00B8
                NiAVObject* NiAVObject;//0x00BC
                std::uint8_t gapC0[20];//0x00C0
                DWORD m_eViewMode;//0x00D4
                std::uint8_t gapD8[60];//0x00D8
                float float114;//0x0114
                std::uint8_t gap118[8];//0x0118
                float ViewOffsetByPitch;//0x0120 ViewOffset by Pitch
				std::uint8_t IsCrouch;//0x0124
				std::uint8_t IsCrouchAnimActive;//0x0125
				std::uint8_t IsCrouchIdk1;//0x0126
				std::uint8_t IsCrouchIdk2;//0x0127
                float CurrHeight;//0x0128 CurrHeight
				float FinalCurrHeight;//0x012C FinalCurrHeight
                std::uint8_t gap12C[24];//0x0130
                std::uint8_t byte148;//0x0148   
                std::uint8_t byte149;//0x0149
                float m_vBonePos[3];//0x014C
                std::uint8_t gap158[756];//0x0158
                CGamePlayer* CGamePlayer;//0x044C
				std::uint8_t gap450[76];//0x0450
				float idkk[100];//0x049C
            };

            static auto sub_57B550_addy = enc_ptr(0x0057B550);
            static auto sub_579690_addy = enc_ptr(0x00579690);
            static auto sub_5778F0_addy = enc_ptr(0x005778F0);
            static auto sub_577D90_addy = enc_ptr(0x00577D90);
            static auto NormalizeRadian_addy = enc_ptr(0x004585C0);
            static auto sub_578030_addy = enc_ptr(0x00578030);
            static auto sub_577EE0_addy = enc_ptr(0x00577EE0);
            static auto NiMatrix3FromEulerAnglesZYX_addy = enc_ptr(0x00CCA8E0);
			static auto sub_465A40_addy = enc_ptr(0x00465A40);
			static auto sub_5797B0_addy = enc_ptr(0x005797B0);
			static auto NiAVObjectUpdate_addy = enc_ptr(0x00CC7660);
			static auto sub_4586C0_addy = enc_ptr(0x004586C0);
			static auto sub_56F5C0_addy = enc_ptr(0x0056F5C0);


            using Sub57B550Func = void(__thiscall*)(CCameraTPS*);
